ext_alsav/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_СоответствиеДополнительныхРеквизитовХарактеристики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>алсав_СоответствиеДополнительныхРеквизитовХарактеристики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Декор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/СвободныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СвободныеОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезервеСоСклада</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезервеПодЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/ТоварыКОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыКОтгрузке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезерве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/ГрафикПоступленияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ГрафикПоступленияТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоИзЗаказов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/ГрафикОтгрузкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ГрафикОтгрузкиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоНеобеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПодЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоИзЗаказов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/ДоступныеОстаткиПланируемыхПоступлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДоступныеОстаткиПланируемыхПоступлений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаДоступности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/Catalogs/ХарактеристикиНоменклатуры/Ext/ManagerModule.bsl
Функция ЗаполнитьДополнительныеХарактеристикиПоСоотвествию() экспорт
	
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК Т
	               |ГДЕ
	               |	Т.Значение = &Декор";

	
	таблицаСоотвтествия = РегистрыСведений.алсав_СоответствиеДополнительныхРеквизитовХарактеристики.Выбрать();
	
	//Для Каждого стр из таблицаСоотвтествия Цикл
	Пока таблицаСоотвтествия.Следующий() Цикл
		стр = таблицаСоотвтествия;
		
		Запрос.УстановитьПараметр("Декор", стр.Декор);
		
		рез = Запрос.Выполнить().Выбрать();
		 
		Пока Рез.Следующий() Цикл
			ф = Ложь;
			об = рез.Ссылка.ПолучитьОбъект();
			//Если ЗначениеЗаполнено(Стр.Декор) Тогда
			//	Ф = истина;
			//	УстановитьЗначениеДопРеквизита(об, стр.Декор.Владелец, стр.Декор);
			//КонецЕсли;
			
			Если ЗначениеЗаполнено(Стр.Цвет) Тогда
				
				тек = алсав_ДопРеквизиты.ПолучитьДопРеквизит(об,"Цвет");
				Если тек <> стр.Цвет Тогда
					Ф = истина;
					алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(об, "Цвет", стр.Цвет);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Стр.Тон) Тогда
				
				тек = алсав_ДопРеквизиты.ПолучитьДопРеквизит(об,"Тон");
				Если тек <> стр.Тон Тогда
					Ф = истина;
					алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(об, "Тон", стр.Тон);
				КонецЕсли;
			КонецЕсли;
			
			Если ф Тогда
				об.ОбменДанными.Загрузка = Истина;
				об.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецФункции


Функция ПолучитьХарактеристикуПоШтрихкоду(штрихкод, номенклатура = неопределено) ЭКСПОРТ
	Запрос = Новый Запрос;         
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод",штрихкод);
	
	рез = Запрос.Выполнить().Выбрать();

	Пока рез.Следующий() Цикл
		Если ЗначениеЗаполнено(номенклатура) Тогда
			Если номенклатура=рез.Номенклатура Тогда
				Возврат рез.Характеристика;
			КонецЕсли;
		Иначе
			Возврат рез.Характеристика;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции
	

Функция ОбновитьИмеетВариантКомплектации(характеристика = неопределено) ЭКСПОРТ
	
	имяДопРеквизитаИмеетВариантКомплектации = "Имеет вариант комплектации";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросИмеетВариантКомплектации();
	Запрос.УстановитьПараметр("ЭтоМатериалы",ЛОЖЬ);
	Запрос.УстановитьПараметр("имяДопРеквизитаИмеетВариантКомплектации",имяДопРеквизитаИмеетВариантКомплектации);

	
	Если характеристика <> неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И ХарактеристикиНоменклатуры.Ссылка = &характеристика";
		Запрос.УстановитьПараметр("характеристика",характеристика);
	КонецЕсли;
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Попытка
			Если алсав_ДопРеквизиты.ПолучитьДопРеквизит(Рез.ХарактеристикиНоменклатуры, имяДопРеквизитаИмеетВариантКомплектации) <> рез.ИмеетВариантКомплектации Тогда
				оНоменклатура = Рез.ХарактеристикиНоменклатуры.ПолучитьОбъект();
				алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(оНоменклатура,имяДопРеквизитаИмеетВариантКомплектации,рез.ИмеетВариантКомплектации);
				оНоменклатура.ОбменДанными.Загрузка = Истина;
				оНоменклатура.Записать();
			КонецЕсли
		Исключение
		КонецПопытки;
	КонецЦикла
КонецФУнкции

Функция Обновить_ПланируетсяКПересчету()ЭКСПОРТ
	имяДопРеквизит = "Планируется к пересчету";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("имяДопРеквизит",имяДопРеквизит);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Набор.Номенклатура КАК Номенклатура,
	               |	Набор.Характеристика КАК Характеристика,
	               |	Набор.Склад КАК Склад,
	               |	СУММА(Набор.ВНаличии) КАК ВНаличии,
	               |	СУММА(Набор.ВРезервеСоСклада) КАК ВРезервеСоСклада,
	               |	СУММА(Набор.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
	               |	СУММА(Набор.КОтгрузке) КАК КОтгрузке
	               |ПОМЕСТИТЬ ВтСвободныеОстатки
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Таблица.Номенклатура КАК Номенклатура,
	               |		Таблица.Характеристика КАК Характеристика,
	               |		Таблица.Склад КАК Склад,
	               |		Таблица.ВНаличииОстаток КАК ВНаличии,
	               |		Таблица.ВРезервеСоСкладаОстаток КАК ВРезервеСоСклада,
	               |		Таблица.ВРезервеПодЗаказОстаток КАК ВРезервеПодЗаказ,
	               |		0 КАК КОтгрузке
	               |	ИЗ
	               |		РегистрНакопления.СвободныеОстатки.Остатки(, ) КАК Таблица
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		Таблица.Номенклатура,
	               |		Таблица.Характеристика,
	               |		Таблица.Склад,
	               |		Таблица.КОтгрузкеОстаток,
	               |		0,
	               |		0,
	               |		Таблица.КОтгрузкеОстаток
	               |	ИЗ
	               |		РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК Таблица) КАК Набор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Набор.Номенклатура,
	               |	Набор.Характеристика,
	               |	Набор.Склад
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Характеристика,
	               |	Склад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Хар.Ссылка КАК Характеристика,
	               |	СУММА(Набор.ВНаличии) КАК ВНаличии,
	               |	СУММА(Набор.ПриходОсновной) КАК ПриходОсновной,
	               |	ВЫБОР
	               |		КОГДА СУММА(Набор.ВНаличии) + СУММА(Набор.ПриходОсновной) > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПланируетсяКПересчетуРасчет,
	               |	ЕСТЬNULL(ДопРеквХар.Значение, ЛОЖЬ) КАК ПланируетсяКПересчету
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК Хар
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Таблица.Номенклатура КАК Номенклатура,
	               |			Таблица.Характеристика КАК Характеристика,
	               |			Таблица.Склад КАК Склад,
	               |			Таблица.ВНаличии КАК ВНаличии,
	               |			0 КАК ПриходОсновной,
	               |			Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада + Таблица.КОтгрузке КАК РасходОсновной,
	               |			Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада КАК ВРезервеСоСкладаИПодЗаказ,
	               |			0 КАК ВРезервеГрафика,
	               |			Таблица.КОтгрузке КАК КОтгрузке
	               |		ИЗ
	               |			ВтСвободныеОстатки КАК Таблица
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			Таблица.Номенклатура,
	               |			Таблица.Характеристика,
	               |			Таблица.Склад,
	               |			0,
	               |			Таблица.КоличествоИзЗаказовОстаток,
	               |			0,
	               |			0,
	               |			0,
	               |			0
	               |		ИЗ
	               |			РегистрНакопления.ГрафикПоступленияТоваров.Остатки(, ) КАК Таблица
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			Таблица.Номенклатура,
	               |			Таблица.Характеристика,
	               |			Таблица.Склад,
	               |			0,
	               |			0,
	               |			Таблица.КоличествоИзЗаказовОстаток,
	               |			0,
	               |			0,
	               |			0
	               |		ИЗ
	               |			РегистрНакопления.ГрафикОтгрузкиТоваров.Остатки(, ) КАК Таблица
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			Таблица.Номенклатура,
	               |			Таблица.Характеристика,
	               |			Таблица.Склад,
	               |			0,
	               |			0,
	               |			0,
	               |			0,
	               |			-Таблица.Количество,
	               |			0
	               |		ИЗ
	               |			РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Таблица
	               |		ГДЕ
	               |			Таблица.Количество < 0
	               |			И Таблица.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)) КАК Набор
	               |		ПО Хар.Ссылка = Набор.Характеристика
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДопРеквХар
	               |		ПО (ДопРеквХар.Ссылка = Хар.Ссылка)
	               |			И (ДопРеквХар.Свойство.Заголовок = &имяДопРеквизит)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Хар.Ссылка,
	               |	ДопРеквХар.Значение
	               |
	               |ИМЕЮЩИЕ
	               |	ЕСТЬNULL(ДопРеквХар.Значение, ЛОЖЬ) <> ВЫБОР
	               |		КОГДА СУММА(Набор.ВНаличии) + СУММА(Набор.ПриходОсновной) > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ";
	
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Попытка
			Если алсав_ДопРеквизиты.ПолучитьДопРеквизит(Рез.Характеристика, имяДопРеквизит) <> рез.ПланируетсяКПересчетуРасчет Тогда
				об = Рез.Характеристика.ПолучитьОбъект();
				алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(об,имяДопРеквизит,рез.ПланируетсяКПересчетуРасчет);
				об.ОбменДанными.Загрузка = Истина;
				об.Записать();
			КонецЕсли
		Исключение
		КонецПопытки;
	КонецЦикла

КонецФункции

Функция ОбновитьИмеетВариантКомплектацииМатериалы(характеристика = неопределено) ЭКСПОРТ
	
	имяДопРеквизитаИмеетВариантКомплектации = "Имеет вариант комплектации по материалам";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросИмеетВариантКомплектации();
	Запрос.УстановитьПараметр("ЭтоМатериалы",ИСТИНА);
	Запрос.УстановитьПараметр("имяДопРеквизитаИмеетВариантКомплектации",имяДопРеквизитаИмеетВариантКомплектации);
	
	
	Если характеристика <> неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И ХарактеристикиНоменклатуры.Ссылка = &характеристика";
		Запрос.УстановитьПараметр("характеристика",характеристика);
	КонецЕсли;
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Попытка
			Если алсав_ДопРеквизиты.ПолучитьДопРеквизит(Рез.ХарактеристикиНоменклатуры, имяДопРеквизитаИмеетВариантКомплектации) <> рез.ИмеетВариантКомплектации Тогда
				оНоменклатура = Рез.ХарактеристикиНоменклатуры.ПолучитьОбъект();
				алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(оНоменклатура,имяДопРеквизитаИмеетВариантКомплектации,рез.ИмеетВариантКомплектации);
				оНоменклатура.ОбменДанными.Загрузка = Истина;
				оНоменклатура.Записать();
			КонецЕсли
		Исключение
		КонецПопытки;
	КонецЦикла
КонецФУнкции

Функция ПолучитьТекстЗапросИмеетВариантКомплектации()
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикиНоменклатуры,
	               |	МАКСИМУМ(НЕ Таблица.Ссылка ЕСТЬ NULL) КАК ИмеетВариантКомплектации
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДопРекв
	               |		ПО (ДопРекв.Ссылка = ХарактеристикиНоменклатуры.Ссылка)
	               |			И (ДопРекв.Свойство.Заголовок = &имяДопРеквизитаИмеетВариантКомплектации)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК Таблица
	               |		ПО (Таблица.Характеристика = ХарактеристикиНоменклатуры.Ссылка)
	               |			И (Таблица.Владелец = ХарактеристикиНоменклатуры.Ссылка.Владелец)
	               |			И (НЕ Таблица.Ссылка.ПометкаУдаления)
	               |			И (Таблица.ЭтоМатериалы = &ЭтоМатериалы)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХарактеристикиНоменклатуры.Ссылка,
	               |	Таблица.Ссылка,
	               |	ДопРекв.Значение
	               |
	               |ИМЕЮЩИЕ
	               |	((НЕ Таблица.Ссылка ЕСТЬ NULL) <> ЕСТЬNULL(ДопРекв.Значение, ЛОЖЬ)
	               |		ИЛИ ДопРекв.Значение ЕСТЬ NULL)";
	
	Возврат ТекстЗапроса
				   
КонецФУнкции


Функция ОбновитьШКАналоги(характеристика = неопределено) ЭКСПОРТ
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Конст.Значение КАК Конст,
	               |	Конст.Ссылка.Владелец КАК Номенклатура,
	               |	Конст.Ссылка КАК Характеристика,
	               |	ШК.Штрихкод КАК Штрихкод,
	               |	ШКАналог.Значение КАК ШКАналог
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК Конст
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШК
	               |		ПО (ШК.Характеристика = Конст.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ШКАналог
	               |		ПО (ШКАналог.Ссылка = Конст.Ссылка)
	               |			И (ШКАналог.Свойство.Заголовок = ""ШК Аналог"")
	               |ГДЕ
	               |	Конст.Свойство.Заголовок = ""Константа Характеристика""
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Конст.Ссылка.Наименование
	               |ИТОГИ
	               |	МАКСИМУМ(Штрихкод)
	               |ПО
	               |	Конст,
	               |	Номенклатура";
	
	резКонст = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока резКонст.Следующий() Цикл
		резНомен = резКонст.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока резНомен.Следующий() Цикл
			нужныйШКАналог = резНомен.Штрихкод;
			рез = резНомен.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока рез.Следующий() Цикл
				Если рез.ШКАналог <> нужныйШКАналог Тогда
					харСсылка = рез.Характеристика;
					Если ЛОЖЬ Тогда харСсылка = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() КонецЕсли;
					
					характеристикаОбъект = харСсылка.ПолучитьОбъект();
					алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(
						характеристикаОбъект,
						"ШК Аналог",
						нужныйШКАналог
					);
					характеристикаОбъект.ОбменДанными.Загрузка = ИСТИНА;
					характеристикаОбъект.Записать();
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьНовыйАртикул(характеристика)ЭКСПОРТ  
	
	наименованиеДопРеквизита = "ИКТ";
	
	Если ЛОЖЬ Тогда характеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент(); КонецЕсли;
	
	Если характеристика.ЭтоГруппа Тогда
		Возврат "";
	КонецЕсли;     
	
	Если характеристика.ПометкаУдаления Тогда
		Возврат "";
	КонецЕсли;
	
	номенклатура = характеристика.Владелец;
	
	
	серия = алсав_ДопРеквизиты.ПолучитьДопРеквизит(номенклатура, "Серия");
	Если ЗначениеЗаполнено(серия) и ЗначениеЗаполнено(серия.Родитель) и ЗначениеЗаполнено(СокрЛП(серия.Родитель.Наименование)) Тогда 
		префиксСерии = СокрЛП(серия.Родитель.Наименование);
		
		префиксСерииДлина8 = префиксСерии;
		пока СтрДлина(префиксСерииДлина8) < 8 цикл
			префиксСерииДлина8 = префиксСерииДлина8 + "0";
		КонецЦикла;
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ TOP 1
		               |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение КАК Значение
		               |ИЗ
		               |	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		               |ГДЕ
		               |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Наименование = &наименованиеДопРеквизита и ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение LIKE (&фильтрПрефикс) ORDER BY ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение DESC"; 
		Запрос.УстановитьПараметр("наименованиеДопРеквизита",наименованиеДопРеквизита);
		Запрос.УстановитьПараметр("фильтрПрефикс",префиксСерии+"%");
		
		рез = Запрос.Выполнить().Выбрать();
		если Рез.Следующий() Тогда 
			последнийАртикул = число(рез.Значение) - число(префиксСерииДлина8);
			
		Иначе
			последнийАртикул = 0; 
		КонецЕсли;
	Иначе
		Возврат "";
	КонецЕсли;
	
	новыйАртикулЧисло = число(префиксСерииДлина8) + последнийАртикул + 1;
	
	новыйАртикул = Формат(новыйАртикулЧисло, "ЧГ=0");

	пока СтрДлина(новыйАртикул) < 8 цикл
		новыйАртикул = "0" + новыйАртикул;
	КонецЦикла;

	возврат новыйАртикул;
	
КонецФункции


Функция ПлучитьСтруктуруПутейКартинок(ссылка, путь)  
	Если ЛОЖЬ Тогда ссылка = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(); КонецЕсли;
	//"9.021 HORECA"
	//"9.012.HOME"//alsav-horeca.ru
	
	//Путь
	//Путь next-meb
	//Путь alsav	
	//Путь vsiamebel 
	
	мИсключения = Новый Массив; 
	мИсключения.Добавить("9.021 HORECA");
	мИсключения.Добавить("9.012.HOME");
	
	соответсвиеСвойствоХост = новый Соответствие;
	//соответсвиеСвойствоХост.Вставить("Путь next-meb","i.next-meb.ru");
	//соответсвиеСвойствоХост.Вставить("Путь alsav","alsav.ru");
	//соответсвиеСвойствоХост.Вставить("Путь vsiamebel","i.vsiamebel.ru"); 
	
	родитель = ссылка.Владелец;
	искл = ложь;
	Пока ЗначениеЗаполнено(родитель) Цикл
		Если мИсключения.Найти(Строка(родитель)) <> Неопределено Тогда
			искл = истина;
		КонецЕсли;
		родитель = родитель.Родитель;
	КонецЦикла;
	
	
	алсав = СтрЗаменить(СтрЗаменить(путь,"i.next-meb.ru","alsav.ru"),"i.vsiamebel.ru","alsav.ru");
	Если искл Тогда
		соответсвиеСвойствоХост.Вставить("Путь alsav",СтрЗаменить(алсав,"alsav.ru","alsav-horeca.ru"));
	Иначе
		соответсвиеСвойствоХост.Вставить("Путь next-meb",СтрЗаменить(алсав,"alsav.ru","i.next-meb.ru"));
		соответсвиеСвойствоХост.Вставить("Путь alsav",алсав);
		соответсвиеСвойствоХост.Вставить("Путь vsiamebel",СтрЗаменить(алсав,"alsav.ru","i.vsiamebel.ru"));
	КонецЕсли;
	
	возврат соответсвиеСвойствоХост;
КонецФункции

Функция ЗаполнитьURLКартинок(мСсылки = неопределено)ЭКСПОРТ

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Все",?(мСсылки = неопределено, истина, ЛОЖЬ));
	Запрос.УстановитьПараметр("мСсылки", мСсылки);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.Ссылка КАК Ссылка,
	               |	Т.Свойство КАК Свойство,
	               |	Т.Значение КАК Значение,
	               |	ДС_ПутьNext.Значение КАК next,
	               |	ДС_ПутьAlsavt.Значение КАК alsav,
	               |	ДС_ПутьVsiamebel.Значение КАК vsiamebel
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК Т
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДС_ПутьNext
	               |		ПО Т.Ссылка = ДС_ПутьNext.Ссылка
	               |			И (ДС_ПутьNext.Свойство.Заголовок = ""Путь next-meb"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДС_ПутьAlsavt
	               |		ПО Т.Ссылка = ДС_ПутьAlsavt.Ссылка
	               |			И (ДС_ПутьAlsavt.Свойство.Заголовок = ""Путь alsav"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДС_ПутьVsiamebel
	               |		ПО Т.Ссылка = ДС_ПутьVsiamebel.Ссылка
	               |			И (ДС_ПутьVsiamebel.Свойство.Заголовок = ""Путь vsiamebel"")
	               |ГДЕ
	               |	(&Все
	               |			ИЛИ Т.Ссылка В (&мСсылки))
	               |	И Т.Свойство.Заголовок = ""Путь""
				   | 	И ДС_ПутьAlsavt.Значение IS NULL"; 
	
	рез = Запрос.Выполнить().Выбрать();
	Пока рез.Следующий() Цикл 
		разбикаПутей = ПлучитьСтруктуруПутейКартинок(рез.Ссылка, рез.Значение );
		Если ЛОЖЬ Тогда разбикаПутей = новый Соответствие; КонецЕсли;
		
		об = рез.Ссылка.ПолучитьОбъект();
		Если ЛОЖЬ Тогда об = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент(); КонецЕсли;
		Для Каждого эл из разбикаПутей Цикл
			алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(об, эл.Ключ,эл.Значение);
		КонецЦикла;                                               
		об.ОбменДанными.Загрузка = истина;
		об.Записать();
	конецЦикла;
КонецФУнкции
